package domain.models;

public class AituInfo {
    private String info;

    public String getInfo(){
        return "https://astanait.edu.kz \nAstana IT University— высшее учебное заведение, направленное на подготовку высококвалифицированных специалистов в области IT. Университет был открыт Фондом Первого Президента Республики Казахстан, в 2019 году.\n" +
                "\n" +
                "Astana IT University совместно с Astana Hub и AIFC Fintech Hub интегрированы в экосистему Expo 2017, для развития цифрового будущего Казахстана. Миссия университета - обеспечить цифровую трансформацию страны, по средствам исследований, подготовки новых кадров и разработки успешных инноваций. Университет находится в эпицентре IT инфраструктуры столицы, где проводятся все главные Digital мероприятия страны, целью которых является развитие студенческого предпринимательства, проведение обучающих семинаров, хакатонов и продвижен" +
                "ие стартапов.\n" +
                "История\n" +
                "Astana IT University был создан в феврале 2019 года по инициативе Елбасы Нурсултана Назарбаева в целях поддержки реализации четвертого направления \"Развитие человеческого капитала\" Государственной программы \"Цифровой Казахстан " +
                "20 ноября 2019 года - Визит Президента РК Касым-Жомарт Токаева в рамках ознакомления с объектами инновационной экосистемы столицы.\n" +
                "\n" +
                "Обучение\n" +
                "Обучение в университете проводится на английском языке по программам:\n" +
                "Бакалавриат\n" +
                "Магистратура\n" +
                "Дополнительные специализированные курсы Занятия проводит профессорско-преподавательский состав, а именно выпускники зарубежных вузов мира:  University of Southern California (США), Boston University (США), The University of Chicago (США), University College London (Великобритания), Imperial College London (Великобритания), Robert Gordon University (Великобритания), Университет Гумбольта (Берлин, Германия), University of Bristol (Великобритания), The University of Sheffield (Великобритания).\n" +
                "Информацион-но-коммуникационные\n" +
                "технологии\n" +
                "В057\n" +
                "Информацион-ные технологии\n" +
                "\n" +
                "1.    «Computer Science» (Компьютерные науки)\n" +
                "2.    «Software Engineering»  (Разработка программного обеспечения)\n" +
                "3.    «Big Data Analysis»  (Анализ больших данных)\n" +
                "4.    «Industrial Automation» (Промышленная автоматизация)\n" +
                "5.    «Media technologies» (Медиа технологии)\n" +
                "Используются следующие базы данных для обучения:\n" +
                "1) Web of Science,\n" +
                "2) Scopus,\n" +
                "3) Springer,\n" +
                "4) Science Direct.";
    }

    public String getInfrastructure(){
        return "Инфраструктура вуза:\n" +
                "\n" +
                "- 3 учебных корпуса (общая площадь - 37,6 тыс. м2);\n" +
                "\n" +
                "- 2 жилых помещений студентов на 350 мест;\n" +
                "\n" +
                "- 2 дома для ППС и сотрудников;\n" +
                "\n" +
                "- современные учебные лаборатории Cisco, Huawei, Kaspersky, IPMA;\n" +
                "\n" +
                "- 6 лекционных, 27 учебных аудиторий (все аудитории оснащены интерактивными проекторами, компьютерной техникой и аудио-видеосистемами);\n" +
                "\n" +
                "- 12 инновационных компьютерных лабораторий;\n" +
                "\n" +
                "- современный актовый зал на 450 мест;\n" +
                "\n" +
                "- электронный читальный зал на 50 посадочных мест;\n" +
                "\n" +
                "- спортивный и тренажерный залы.\n" +
                "\n" +
                "- Медиа центр с телевизионной и радиовещательной студиями;\n" +
                "\n" +
                "- здравпункт, оснащенный современным оборудованием и укомплектованный ведущими специалистами-медиками;\n" +
                "\n" +
                "- студенческая столовая на 250 посадочных мест;\n" +
                "\n" +
                "- корпоративная компьютерная сеть;\n" +
                "\n" +
                "- 250 Wi-Fi точек с бесплатным доступом в интернет.;\n" +
                "\n" +
                "- 529 единиц компьютеров;\n" +
                "\n" +
                "- IP телефония с виртуальной АТС.\n" +
                "\n";
    }

    public String getEducationalPrograms(){
        return "https://astanait.edu.kz/programs/";
    }
}
